C5Lab/M5MonsterC5-Tab5/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Tab5 uses the ESP32-P4 revision 1 clock tree (360/180/90 MHz).
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# Power management (DFS) is deliberately OFF: run the CPU at a flat 360 MHz.
#
# esp_pm's DFS does not scale with CPU load - min_freq_mhz is "the frequency to
# use when no locks are taken" (esp_pm.h). Nothing in the UI path takes an
# ESP_PM_CPU_FREQ_MAX lock; only WPA cracking did. So with PM enabled the board
# spent normal operation at APP_POWER_CPU_MIN_MHZ (40 MHz) - nine times below
# what it can do - and the whole GUI rendered at that speed. Measured on the
# same build: building the boot splash took 9 ms with PM off versus 190 ms with
# PM on. That was the cause of the "laggy GUI", not USB.
#
# Re-enabling this needs a CPU_FREQ_MAX lock held while the screen is on,
# otherwise the "interactive" profile is the slowest configuration available.
# CONFIG_PM_ENABLE=y

# Increase watchdog timeout for LCD init
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_INT_WDT_TIMEOUT_MS=800
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0

# Run code and rodata from flash (via the L2 cache), NOT XIP from PSRAM.
#
# The MIPI-DSI panel continuously scans its framebuffer out of PSRAM at roughly
# 110 MB/s (720x1280x2 @ 60 Hz). With SPIRAM_XIP_FROM_PSRAM / FETCH_INSTRUCTIONS
# / RODATA enabled, every LVGL instruction fetch also went through PSRAM and
# competed for that bus. Attaching a Monster over USB-A added its periodic host
# DMA on the same bus and tipped it over: building the status bar took 119 ms of
# LVGL time with USB vs 9 ms without (CPU was 99% idle - it was pure memory-bus
# contention, not compute, not console spam). Moving code to flash took LVGL off
# the PSRAM bus and restored 9 ms with USB attached.
#
# Side benefits: ~4 MB more PSRAM heap (flash no longer mirrored into it) and a
# faster boot. Trade-off to watch: runtime flash writes (NVS, Monster OTA) can
# briefly stall code execution now that code lives in flash - if new hitches
# appear specifically during flash/NVS writes, that is the cause.
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
# CONFIG_SPIRAM_FLASH_LOAD_TO_PSRAM is not set
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# Increase IDLE task stack for task cleanup with DMA/interrupts active
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=3072
CONFIG_ESP_BROOKESIA_MEMORY_USE_CUSTOM=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y
# LVGL 9.x Memory - use standard C malloc (goes to PSRAM with SPIRAM_MALLOC_ALWAYSINTERNAL=0)
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=25
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_PERF_MONITOR=y
# LV_ATTRIBUTE_FAST_MEM_USE_IRAM would put LVGL's hot drawing code
# (lv_draw_sw_blend, lv_draw_label/rect/line/mask) in internal RAM instead of
# running it XIP from PSRAM, so rendering would stop competing for the PSRAM
# bus - the reason the UI crawls while a Monster is attached over USB-A (status
# bar builds in 24 ms without USB, 138 ms with it, DFS already off). M5Stack's
# own M5Tab5-UserDemo enables it.
#
# It does not fit here. Enabling it fails to link with "Total discarded sections
# size is 46856 bytes", and the discarded sections are libc .sbss/.sdata - the
# shortfall is in internal *data*, since the P4 shares one internal SRAM between
# instructions and data. Tried freeing it by turning off the P4-side esp_wifi
# IRAM optimizations (Wi-Fi runs on the C6 over SDIO, so they looked free): the
# shortfall stayed at exactly 46856 bytes, because with ESP_HOST_WIFI_ENABLED
# off the native esp_wifi library is not linked at all and those options were
# already costing nothing.
#
# This firmware simply carries far more in internal RAM than the M5Stack demo:
# USB CDC host DMA, ESP-Hosted SDIO, the audio codec pipeline and SD. Do not
# retry without first finding ~47 KB of real internal-RAM savings.
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set
# CH34X uses a 32-byte BULK IN endpoint.  Keep the submitted host transfer at
# one endpoint packet so a full 32-byte ACK32 completes immediately instead of
# waiting for a short packet or for the component's default 512-byte request.
CONFIG_IN_TRANSFER_BUFFER_SIZE=32
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_MONTSERRAT_46=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ESP-Hosted WiFi configuration (ESP32C6 as WiFi coprocessor via SDIO)
# Disable host WiFi to enable WiFi Remote
CONFIG_ESP_HOST_WIFI_ENABLED=n
# Select esp_hosted as WiFi Remote backend
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
# Select ESP32C6 as slave target
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# Tab5 has different GPIO than ESP32-P4-Function-EV-Board - use custom config
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y

# Tab5 SDIO GPIO configuration for ESP32-C6
# From Tab5 documentation:
# ESP32-P4 G11=D0, G10=D1, G9=D2, G8=D3, G13=CMD, G12=CLK, G15=RESET, G14=IO2
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=12
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=13
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=11
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=10
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=9
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15

# SDIO RX: fixed max-packet reads instead of streaming aggregates.
# Streaming mode sizes its RX buffer from whatever the slave queued and has to
# grow it mid-transfer out of DMA-capable memory. Measured on this board during
# a transfer: 9387 B free but the largest contiguous block is 1920 B, while the
# stream asks for 2048-3072. The pool is permanently fragmented below 2 KB, so
# that allocation can never succeed and the RX path wedges for good (Wi-Fi then
# dies with RPC timeouts). Packet mode reads a fixed 1536 B into recycled
# mempool blocks, so nothing is ever allocated on the hot path.
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_MAX_SIZE=y

# WiFi Remote settings
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64

# FATFS Long File Name support (for SD card HTML files)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# FATFS read performance (ESPShark PCAP indexing).
# Without these, newlib falls back to a 128-byte file buffer and every backward
# lseek walks the FAT cluster chain from the start of the file, which dominates
# the cost of indexing a multi-megabyte capture. See doc section 36.
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096
CONFIG_FATFS_USE_FASTSEEK=y
# CLMT entries per open read-mode file; too small and fast-seek silently falls
# back to the slow path on a fragmented file.
CONFIG_FATFS_FAST_SEEK_BUFFER_SIZE=256

# HTTP server - increase header buffer for modern browsers
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024










